docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex
% Created 2026-02-24 Tue 12:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Prologos Project}
\date{2026-02-24}
\title{Towards a General Logic Engine on Propagators\\\medskip
\large Lattice-Theoretic Foundations and Architectural Recommendations for Prologos}
\hypersetup{
 pdfauthor={Prologos Project},
 pdftitle={Towards a General Logic Engine on Propagators},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Executive Summary}
\label{sec:org7243b99}

This document synthesizes two extensive research surveys --- the Lattice-Based
Propagator Networks survey and the Propagator Networks research report --- into
a concrete architectural recommendation for Prologos's logic engine. The
central thesis:

\begin{quote}
Prologos should build its logic engine as a \textbf{stratified propagator network}
with an ATMS worldview layer, using lattice-compatible data structures (LVars)
as the monotonic data plane and assumption-based truth maintenance as the
non-monotonic control plane. Tabling provides completeness; stratification
provides negation. The same substrate should serve both compile-time
(type checking, elaboration) and runtime (logic programming, constraint
solving) use cases.
\end{quote}

The two user-proposed mechanisms --- the "Multiverse Mechanism" (choice-point
forking via ATMS worldviews) and the "Pocket Universe Mechanism" (scoped
computation via lattice embeddings) --- are both \textbf{validated} by the research
and directly implementable. The Multiverse Mechanism maps onto ATMS's
simultaneous worldview maintenance, recovering nondeterminism atop a
monotonic substrate. The Pocket Universe Mechanism maps onto Galois
connections between abstract and concrete domains, enabling modular
constraint domains and scoped sub-computations.

\textbf{Key architectural choices:}

\begin{enumerate}
\item \textbf{Propagator cells} with user-defined lattice merge (Radul-Sussman model)
\item \textbf{ATMS layer} for hypothetical reasoning, \texttt{amb}, and dependency-directed backtracking
\item \textbf{Tabling} for termination and completeness (SLG-style, with lattice answer modes)
\item \textbf{Stratified evaluation} for negation, aggregation, and non-monotonic operations
\item \textbf{Galois-connected domain embeddings} for modular constraint solvers
\item \textbf{Phased implementation} starting with compile-time use (elaborator propagators),
then extending to runtime logic programming
\end{enumerate}
\section{Part I: Lattice Foundations}
\label{sec:org1d4a47e}

\subsection{1. Why Lattices?}
\label{sec:org496ff82}

A \textbf{lattice} is an algebraic structure that captures the notion of
\emph{partial information} and \emph{refinement}. In programming language theory,
lattices appear everywhere:

\begin{itemize}
\item \textbf{Type inference}: the substitution lattice (from most general to most specific)
\item \textbf{Abstract interpretation}: concrete/abstract domain pairs connected by Galois connections
\item \textbf{Constraint propagation}: cell values that accumulate knowledge monotonically
\item \textbf{Distributed systems}: CRDTs converging through lattice joins
\end{itemize}

For a logic engine, lattices provide the mathematical guarantee that
computation \textbf{converges} --- that iteratively refining partial answers
eventually reaches a stable fixed point.
\subsection{2. Crash Course: The Lattice Zoo}
\label{sec:org7910986}

\subsubsection{2.1 Partial Orders}
\label{sec:org92c7757}

A \textbf{partial order} \((S, \leq)\) is a set \(S\) with a binary relation \(\leq\) that is:

\begin{itemize}
\item \textbf{Reflexive}: \(a \leq a\)
\item \textbf{Antisymmetric}: \(a \leq b\) and \(b \leq a\) implies \(a = b\)
\item \textbf{Transitive}: \(a \leq b\) and \(b \leq c\) implies \(a \leq c\)
\end{itemize}

The ordering represents "has at least as much information as." In a type
inference context: \texttt{Int} \(\leq\) \texttt{?a} means "knowing the type is \texttt{Int}
is more informative than knowing nothing (metavariable \texttt{?a})."

Not all elements need be comparable --- this is the "partial" in partial
order. Two type constraints might be independent (neither implies the other).
