docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex
\subsubsection{2.2 Join-Semilattices}
\label{sec:orgd993916}

A \textbf{join-semilattice} \((L, \leq, \bot, \sqcup)\) adds:

\begin{itemize}
\item A \textbf{bottom} element \(\bot\) (least informative --- "nothing")
\item A \textbf{join} operation \(\sqcup\) (least upper bound --- "combine information")
\end{itemize}

The join is:
\begin{itemize}
\item \textbf{Commutative}: \(a \sqcup b = b \sqcup a\)
\item \textbf{Associative}: \((a \sqcup b) \sqcup c = a \sqcup (b \sqcup c)\)
\item \textbf{Idempotent}: \(a \sqcup a = a\)
\end{itemize}

Join is the \emph{merge} operation in propagator networks. When two propagators
contribute information to the same cell, join combines them. Commutativity
means the order doesn't matter; idempotency means duplicate contributions
are harmless.
\subsubsection{2.3 Complete Lattices and Top}
\label{sec:orgc32f835}

A \textbf{complete lattice} also has:
\begin{itemize}
\item A \textbf{top} element \(\top\) (maximally informative --- \emph{contradiction})
\item \textbf{Meet} operation \(\sqcap\) (greatest lower bound)
\end{itemize}

Top represents incompatible information merged together. When a type
checker discovers that a variable must be both \texttt{Int} and \texttt{String}, the
result is \(\top\) --- contradiction. The propagator network must handle this
by backtracking or reporting an error.
\subsubsection{2.4 Fixed Points: Why Lattices Guarantee Convergence}
\label{sec:org02eac93}

\textbf{Knaster-Tarski theorem}: Every monotone function \(f : L \to L\) on a
complete lattice has a least fixed point:

\(\mathrm{lfp}(f) = \bigsqcap \{ x \in L \mid f(x) \leq x \}\)

\textbf{Kleene iteration}: On a dcpo with \(\bot\), the least fixed point of a
Scott-continuous \(f\) is computed by iterating from bottom:

\(\mathrm{lfp}(f) = \bigsqcup_{n \in \mathbb{N}} f^n(\bot)\)

This is exactly what propagator networks do: start with all cells at \(\bot\)
(no information), iterate propagators (apply \(f\)), and converge to the
least fixed point (the most general solution).
\subsubsection{2.5 Finite Height and Termination}
\label{sec:orgb81fb20}

If the lattice has \textbf{finite height} (longest ascending chain is bounded),
then Kleene iteration terminates in at most \(h\) steps, where \(h\) is the
height. For infinite-height lattices (e.g., intervals over reals),
\textbf{widening} operators accelerate convergence:

\(a \nabla b \geq a \sqcup b\)

Widening over-approximates to ensure termination; \textbf{narrowing} then
recovers precision:

\(a \leq a \triangle b \leq a \quad \text{when } b \leq a\)
\subsection{3. Key Lattice Structures for Logic Programming}
\label{sec:orgf00992d}

\subsubsection{3.1 The Substitution Lattice}
\label{sec:org77cd5e3}

Unification operates on a lattice of substitutions:

\begin{itemize}
\item \(\bot\) = identity substitution (no bindings)
\item \(\sigma \leq \tau\) iff \(\tau\) is a specialization of \(\sigma\) (more bindings)
\item \(\sigma \sqcup \tau\) = most general unifier (mgu) of \(\sigma\) and \(\tau\)
\item \(\top\) = failure (no unifier exists)
\end{itemize}

This is the fundamental lattice for Prolog-style logic programming:
every resolution step computes a join on the substitution lattice.
\subsubsection{3.2 The Herbrand Interpretation Lattice}
\label{sec:org512d620}

For Datalog/bottom-up evaluation:

\begin{itemize}
\item Elements are sets of ground atoms (Herbrand interpretations)
\item \(\bot\) = empty set
\item \(I_1 \leq I_2\) iff \(I_1 \subseteq I_2\)
\item \(I_1 \sqcup I_2 = I_1 \cup I_2\)
\item The immediate consequence operator \(T_P\) maps an interpretation to its
one-step derivation
\end{itemize}

The least fixed point of \(T_P\) gives the minimal Herbrand model --- all
provable ground facts.
\subsubsection{3.3 The Interval Lattice}
\label{sec:orgb43961f}

For numeric constraint propagation:

\begin{itemize}
\item Elements are intervals \([a, b]\) over \(\mathbb{R}\)
\item \(\bot\) = \(\mathbb{R}\) (no constraint)
\item \([a_1, b_1] \sqcap [a_2, b_2] = [\max(a_1, a_2), \min(b_1, b_2)]\)
(intersection = more constrained)
\item \(\top\) = \(\emptyset\) (contradictory constraints)
\end{itemize}
\subsubsection{3.4 The Protocol State Lattice (Session Types)}
\label{sec:org2381593}

For Prologos's session type verification:

\begin{itemize}
\item \(\bot\) = unconstrained channel
\item Interior elements = specific protocol states (e.g., "send Int then receive String")
\item \(\top\) = protocol violation
\item Duality checking: two endpoints' protocol states must be lattice-dual
\end{itemize}
\subsubsection{3.5 The Multiplicity Semiring (QTT)}
\label{sec:org90250d6}

For Prologos's quantitative type theory:

\begin{itemize}
\item Elements: \(\{0, 1, \omega\}\) (erased, linear, unrestricted)
\item Addition: resource usage accumulation
\item Multiplication: usage in composed contexts
\item This forms a \emph{semiring}, not a lattice per se, but the ordering \(0 \leq 1 \leq \omega\)
creates a lattice structure useful for propagation
\end{itemize}
\section{Part II: The Architectural Recommendation}
\label{sec:orgd5aa6b5}
