docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex

\subsection{4. The Three-Layer Architecture}
\label{sec:orgbb9fa46}

We recommend a three-layer architecture for Prologos's logic engine:

\begin{verbatim}
┌─────────────────────────────────────────────────────┐
│  Layer 3: STRATIFICATION                            │
│  Negation, aggregation, non-monotone operations     │
│  Evaluated stratum-by-stratum (lower strata first)  │
└─────────────┬───────────────────────────┬───────────┘
              │                           │
┌─────────────▼───────────────────────────▼───────────┐
│  Layer 2: ATMS / TRUTH MAINTENANCE                  │
│  Hypothetical reasoning (amb, worldviews)           │
│  Nogood recording, dependency-directed backtracking  │
│  Non-monotonic control over monotonic data           │
└─────────────┬───────────────────────────┬───────────┘
              │                           │
┌─────────────▼───────────────────────────▼───────────┐
│  Layer 1: PROPAGATOR NETWORK                        │
│  Cells (lattice values) + Propagators (monotone fns)│
│  Merge = lattice join                               │
│  Deterministic, order-independent, parallelizable   │
└─────────────────────────────────────────────────────┘
\end{verbatim}
\subsubsection{Layer 1: The Propagator Network (Monotonic Data Plane)}
\label{sec:org1455ada}

The foundation. Cells hold partial information (lattice elements);
propagators compute monotone functions between cells. When a cell's
value increases (via merge/join), all downstream propagators are
scheduled for re-execution. This layer guarantees:

\begin{itemize}
\item \textbf{Determinism}: same inputs \(\to\) same fixed point, regardless of scheduling
\item \textbf{Convergence}: finite-height lattices terminate; widening handles infinite ones
\item \textbf{Parallelism}: propagators can execute concurrently (CALM theorem)
\end{itemize}

This is the layer where type inference, constraint propagation, and
dataflow computation live. It is purely monotonic.
\subsubsection{Layer 2: ATMS / Truth Maintenance (Non-Monotonic Control Plane)}
\label{sec:orge4e0eff}

The innovation. The ATMS maintains \emph{all possible worldviews simultaneously}.
Each derived fact is labeled with the set of assumptions that justify it.

\begin{itemize}
\item \textbf{\texttt{amb}} creates fresh hypothetical premises: \(\{h_1, h_2, \ldots\}\)
\item Each branch's facts are \emph{contingent} on its hypothesis
\item \textbf{Nogoods}: when a contradiction is detected, the responsible assumption set
is recorded as a nogood --- permanently invalidating that worldview
\item \textbf{Dependency-directed backtracking}: nogoods identify \emph{which} choice was
wrong, skipping irrelevant alternatives
\end{itemize}

This layer provides nondeterministic search \emph{without backtracking} in the
traditional sense. All branches exist simultaneously in the ATMS; "exploring
a branch" = believing a hypothesis; "backtracking" = recording a nogood.

Key insight from the research: \textbf{the ATMS's set of nogoods is itself a
monotonically growing lattice}. Non-monotonicity in the search space is
reified as monotonicity in the meta-lattice of learned constraints.
\subsubsection{Layer 3: Stratification (Controlled Non-Monotonicity)}
\label{sec:orgcf440ca}

Some operations are genuinely non-monotonic: negation-as-failure,
aggregation (\texttt{count}, \texttt{min}, \texttt{max}), and finalization. These are handled
by \textbf{stratification}:

\begin{enumerate}
\item Decompose the program into strata (strongly connected components of
the dependency graph, with non-monotonic edges crossing strata)
\item Evaluate strata bottom-up: within each stratum, run the propagator
network to its fixed point
\item Between strata, non-monotonic operations observe the \emph{completed} lower
stratum
\end{enumerate}

This is the established technique from Datalog with negation, Flix,
Bloom\textsuperscript{L}, and CHR. The CALM theorem confirms: within a stratum,
computation is coordination-free; stratum boundaries are the minimal
coordination points.
\subsection{5. Validating the Multiverse Mechanism}
\label{sec:orga314ea8}

The user's proposed "Multiverse Mechanism" --- forking lattice state at
choice points, exploring branches independently --- is \emph{directly validated}
by the research. It maps cleanly onto the ATMS worldview model:

\begin{center}
\begin{tabular}{ll}
Multiverse Concept & ATMS Implementation\\
\hline
Choice point & \texttt{amb} creating hypothetical premises \(\{h_i\}\)\\
Fork & Each \(h_i\) labels a worldview\\
Independent evolution & Facts derived under \(h_i\) are contingent\\
Branch contradiction & Nogood set \(\{h_i, \ldots\}\) recorded\\
Branch success & Answer extracted from worldview \(h_i\)\\
All branches at once & ATMS maintains all worldviews simultaneously\\
\end{tabular}
\end{center}
