docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.org
*** Why ATMS over Physical Forking

The research reveals two approaches to forking:

1. *Physical forking* (MUSE/OR-parallelism): Copy the entire state at each
   choice point. Each copy evolves independently.
   - Pro: Simple, naturally parallel
   - Con: O(state_size) per fork; no shared learning between branches

2. *Virtual forking* (ATMS): Tag all facts with their supporting assumptions.
   All worldviews coexist in a single data structure.
   - Pro: O(1) context switching; nogoods shared across worldviews;
     dependency-directed backtracking
   - Con: More complex bookkeeping; label management overhead

*Recommendation for Prologos: ATMS (virtual forking).* The reasons:

- Prologos already has contingent information in its type checker
  (metavariables with constraints that may be retracted)
- Dependency-directed backtracking produces dramatically better error messages
  ("this constraint fails because of /these/ assumptions") vs chronological
  backtracking ("something went wrong somewhere")
- The learning effect: nogoods discovered in one branch prune other branches.
  This is exactly CDCL (Conflict-Driven Clause Learning), which
  revolutionized SAT solving
- Memory efficiency: shared structure between worldviews rather than
  full copies

*** The Multiverse in Practice: A Worked Example

#+begin_src prologos
;; A Prologos logic program (hypothetical syntax)
relation parent : String -> String -> Prop
parent "alice" "bob"
parent "bob" "carol"
parent "bob" "dave"

relation ancestor : String -> String -> Prop
rule ancestor X Y :- parent X Y
rule ancestor X Y :- parent X Z, ancestor Z Y

query ancestor "alice" ?who
;; Expected: ?who = "bob", ?who = "carol", ?who = "dave"
#+end_src

Under ATMS:
1. Create cell for =?who=, initially $\bot$
2. First rule: =parent "alice" ?who= unifies, producing =?who = "bob"=
   under assumption $h_1$
3. Second rule: =parent "alice" ?Z=, =ancestor ?Z ?who=
   - =?Z = "bob"= under $h_2$; then =ancestor "bob" ?who=
   - First rule: =parent "bob" ?who= → =?who = "carol"= under $h_3$
     or =?who = "dave"= under $h_4$ (=amb= on matching clauses)
4. All answers coexist: ={h_1: "bob", h_3: "carol", h_4: "dave"}=
5. Collecting answers = iterating over consistent worldviews


** 6. Validating the Pocket Universe Mechanism

The "Pocket Universe Mechanism" --- isolating a sub-computation in a
smaller lattice, then projecting results back --- maps onto *Galois
connections* from abstract interpretation:

| Pocket Universe Concept | Formal Mapping                                  |
|-------------------------+-------------------------------------------------|
| Outer lattice (full)    | Concrete domain $C$                             |
| Inner lattice (pocket)  | Abstract domain $A$                              |
| Enter pocket            | Abstraction function $\alpha : C \to A$         |
| Compute in pocket       | Fixed point in $A$ (cheaper/faster)              |
| Exit pocket             | Concretization $\gamma : A \to C$               |
| Soundness guarantee     | Galois connection: $\alpha(x) \leq y \iff x \leq \gamma(y)$ |

*** Applications in the Logic Engine

1. *Tabling as pocket universes*: When a tabled predicate is called, a
   sub-computation is launched in a "pocket" (the table). Intermediate
   results are accumulated in the table's lattice. When complete, the
   table's answers are projected back into the calling context via the
   consumer mechanism.

2. *Modular constraint domains*: Each constraint domain (equality,
   ordering, arithmetic, set membership) lives in its own lattice. They
   are embedded into the global propagator network via Galois connections.
   Each domain solver is a "pocket universe" that receives projections of
   the global state and returns refined constraints.

3. *Scoped hypothetical reasoning*: An =amb= creates a pocket universe
   for each alternative. Within each pocket, propagation proceeds
   independently. Nogoods discovered in one pocket prune others via
   the ATMS label mechanism.

4. *Abstract interpretation for type checking*: The type checker operates
   in an abstract domain (types as lattice elements) connected to the
   concrete domain (values) via a Galois connection. This is already
   implicit in Prologos's bidirectional type checking; making it explicit
   with propagators would improve composability and error reporting.


** 7. Recovering SLD/SLG Semantics

