docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex
\subsubsection{Why ATMS over Physical Forking}
\label{sec:org192bd1f}

The research reveals two approaches to forking:

\begin{enumerate}
\item \textbf{Physical forking} (MUSE/OR-parallelism): Copy the entire state at each
choice point. Each copy evolves independently.
\begin{itemize}
\item Pro: Simple, naturally parallel
\item Con: O(state\textsubscript{size}) per fork; no shared learning between branches
\end{itemize}

\item \textbf{Virtual forking} (ATMS): Tag all facts with their supporting assumptions.
All worldviews coexist in a single data structure.
\begin{itemize}
\item Pro: O(1) context switching; nogoods shared across worldviews;
dependency-directed backtracking
\item Con: More complex bookkeeping; label management overhead
\end{itemize}
\end{enumerate}

\textbf{Recommendation for Prologos: ATMS (virtual forking).} The reasons:

\begin{itemize}
\item Prologos already has contingent information in its type checker
(metavariables with constraints that may be retracted)
\item Dependency-directed backtracking produces dramatically better error messages
("this constraint fails because of \emph{these} assumptions") vs chronological
backtracking ("something went wrong somewhere")
\item The learning effect: nogoods discovered in one branch prune other branches.
This is exactly CDCL (Conflict-Driven Clause Learning), which
revolutionized SAT solving
\item Memory efficiency: shared structure between worldviews rather than
full copies
\end{itemize}
\subsubsection{The Multiverse in Practice: A Worked Example}
\label{sec:orgdcb8294}

\begin{verbatim}
;; A Prologos logic program (hypothetical syntax)
relation parent : String -> String -> Prop
parent "alice" "bob"
parent "bob" "carol"
parent "bob" "dave"

relation ancestor : String -> String -> Prop
rule ancestor X Y :- parent X Y
rule ancestor X Y :- parent X Z, ancestor Z Y

query ancestor "alice" ?who
;; Expected: ?who = "bob", ?who = "carol", ?who = "dave"
\end{verbatim}

Under ATMS:
\begin{enumerate}
\item Create cell for \texttt{?who}, initially \(\bot\)
\item First rule: \texttt{parent "alice" ?who} unifies, producing \texttt{?who = "bob"}
under assumption \(h_1\)
\item Second rule: \texttt{parent "alice" ?Z}, \texttt{ancestor ?Z ?who}
\begin{itemize}
\item \texttt{?Z = "bob"} under \(h_2\); then \texttt{ancestor "bob" ?who}
\item First rule: \texttt{parent "bob" ?who} → \texttt{?who = "carol"} under \(h_3\)
or \texttt{?who = "dave"} under \(h_4\) (\texttt{amb} on matching clauses)
\end{itemize}
\item All answers coexist: \texttt{\{h\_1: "bob", h\_3: "carol", h\_4: "dave"\}}
\item Collecting answers = iterating over consistent worldviews
\end{enumerate}
\subsection{6. Validating the Pocket Universe Mechanism}
\label{sec:orgfbb804a}

The "Pocket Universe Mechanism" --- isolating a sub-computation in a
smaller lattice, then projecting results back --- maps onto \textbf{Galois
connections} from abstract interpretation:

\begin{center}
\begin{tabular}{ll}
Pocket Universe Concept & Formal Mapping\\
\hline
Outer lattice (full) & Concrete domain \(C\)\\
Inner lattice (pocket) & Abstract domain \(A\)\\
Enter pocket & Abstraction function \(\alpha : C \to A\)\\
Compute in pocket & Fixed point in \(A\) (cheaper/faster)\\
Exit pocket & Concretization \(\gamma : A \to C\)\\
Soundness guarantee & Galois connection: \(\alpha(x) \leq y \iff x \leq \gamma(y)\)\\
\end{tabular}
\end{center}
\subsubsection{Applications in the Logic Engine}
\label{sec:org921bab0}

\begin{enumerate}
\item \textbf{Tabling as pocket universes}: When a tabled predicate is called, a
sub-computation is launched in a "pocket" (the table). Intermediate
results are accumulated in the table's lattice. When complete, the
table's answers are projected back into the calling context via the
consumer mechanism.

\item \textbf{Modular constraint domains}: Each constraint domain (equality,
ordering, arithmetic, set membership) lives in its own lattice. They
are embedded into the global propagator network via Galois connections.
Each domain solver is a "pocket universe" that receives projections of
the global state and returns refined constraints.

\item \textbf{Scoped hypothetical reasoning}: An \texttt{amb} creates a pocket universe
for each alternative. Within each pocket, propagation proceeds
independently. Nogoods discovered in one pocket prune others via
the ATMS label mechanism.

\item \textbf{Abstract interpretation for type checking}: The type checker operates
in an abstract domain (types as lattice elements) connected to the
concrete domain (values) via a Galois connection. This is already
implicit in Prologos's bidirectional type checking; making it explicit
with propagators would improve composability and error reporting.
\end{enumerate}
\subsection{7. Recovering SLD/SLG Semantics}
\label{sec:orgece61ff}
