docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex

\subsubsection{7.1 SLD Resolution on Propagators}
\label{sec:orgc9dd85a}

SLD resolution (Prolog's execution model) maps onto propagators as follows:

\begin{center}
\begin{tabular}{ll}
SLD Concept & Propagator Implementation\\
\hline
Goal stack & Worklist of pending propagator firings\\
Clause selection & \texttt{amb} over matching clauses\\
Unification & Join on the substitution lattice\\
New subgoals & New propagators added to the network\\
Backtracking & Nogood recording + hypothesis retraction\\
Answer & Fixed point of the substitution cell\\
\end{tabular}
\end{center}

The key difference: SLD's depth-first, left-to-right search becomes the
ATMS's breadth-first, dependency-directed search. This is \emph{more complete}
(no infinite loops from left-recursion) and \emph{more efficient} (nogoods
prune the search space globally).
\subsubsection{7.2 SLG Resolution (Tabling) on Propagators}
\label{sec:org47d5184}

SLG resolution extends SLD with memoization. The propagator mapping:

\begin{center}
\begin{tabular}{ll}
SLG Concept & Propagator Implementation\\
\hline
Table (memo store) & LVar with lattice answer mode\\
Producer & Propagator computing new answers\\
Consumer & Propagator waiting for table answers (threshold read)\\
Completion & Table LVar frozen; no more answers\\
Well-founded semantics & Stratified evaluation of cyclic dependencies\\
\end{tabular}
\end{center}

\textbf{Lattice answer modes} (from XSB Prolog): instead of storing all
individual answers, the table stores the lattice join of all answers.
This subsumes Datalog evaluation and connects directly to Flix's
lattice-valued relations.

\begin{verbatim}
;; SLG-style tabling with lattice answer mode
;; shortest_path(A, B, D) — D is a MinNat lattice value
table shortest_path : String -> String -> MinNat -> Prop
  :answer-mode lattice  ;; join answers via min

rule shortest_path A B 1 :- edge A B
rule shortest_path A C .{D1 + D2}
  :- edge A B, shortest_path B C D2, .{D1 = 1}
\end{verbatim}
\subsubsection{7.3 Cut and Pruning}
\label{sec:orgf4679a7}

Cut maps onto ATMS operations:

\begin{center}
\begin{tabular}{ll}
Cut Variant & Propagator Implementation\\
\hline
\texttt{!} (hard cut) & Retract alternative hypotheses for this \texttt{amb}\\
\texttt{once/1} & Threshold read + freeze on first answer\\
\texttt{if-then-else} & Conditional propagator (threshold on condition)\\
Committed choice & Guard evaluation + monotone commitment\\
\texttt{\textbackslash{}+} (negation-as-failure) & Stratified: evaluate goal in lower stratum, negate\\
\end{tabular}
\end{center}

The ATMS approach is superior to Prolog's chronological backtracking
because cut's \emph{dependency-directed} counterpart (nogood recording)
naturally identifies \emph{which} choices to prune, avoiding the well-known
pitfalls of "red cuts" that silently change program semantics.

\textbf{Recommendation}: Prologos should support \texttt{once} (deterministic commit)
and \texttt{committed-choice} (guard-based), but NOT raw \texttt{!} (Prolog-style cut).
Cut is too low-level and error-prone; the ATMS provides better
alternatives.
\subsection{8. Tabling: The Completeness Mechanism}
\label{sec:org437c11f}

Tabling is \emph{essential} for a practical logic engine. Without it, left-recursive
rules cause infinite loops (in SLD) or redundant computation (in naive
bottom-up evaluation).
\subsubsection{8.1 Design for Prologos}
\label{sec:orgda551bd}

\begin{verbatim}
;; Tabling declaration via spec metadata
spec ancestor : String -> String -> Prop
  :tabled true
  :answer-mode all  ;; or :answer-mode lattice for aggregate answers

;; Implementation is just regular rules
rule ancestor X Y :- parent X Y
rule ancestor X Y :- parent X Z, ancestor Z Y
\end{verbatim}

Under the hood:
\begin{enumerate}
\item First call to \texttt{ancestor} creates a \emph{producer} propagator
\item The producer evaluates rules, pushing answers into a table (LVar)
\item Subsequent calls create \emph{consumer} propagators that read from the table
via threshold reads
\item When the producer reaches a fixed point (no new answers), the table is frozen
\item Consumers receive all answers
\end{enumerate}
\subsubsection{8.2 Lattice Answer Modes}
\label{sec:orgd8e6395}

Following XSB Prolog's design, each tabled predicate can specify an answer
mode:

\begin{itemize}
\item \textbf{\texttt{all}}: Store all distinct answers (standard tabling). The lattice is
the powerset of substitutions.
\item \textbf{\texttt{lattice(f)}}: Aggregate answers via a user-specified lattice join \texttt{f}.
New answers are only "new" if they improve the current aggregate.
This subsumes Datalog with lattices (Flix-style).
\item \textbf{\texttt{first}}: Store only the first answer (\texttt{once} semantics, table frozen
after first answer).
\end{itemize}
