docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.md


<a id="orgbce1a29"></a>

### 7.1 SLD Resolution on Propagators

SLD resolution (Prolog's execution model) maps onto propagators as follows:

| SLD Concept      | Propagator Implementation                |
|---------------- |---------------------------------------- |
| Goal stack       | Worklist of pending propagator firings   |
| Clause selection | `amb` over matching clauses              |
| Unification      | Join on the substitution lattice         |
| New subgoals     | New propagators added to the network     |
| Backtracking     | Nogood recording + hypothesis retraction |
| Answer           | Fixed point of the substitution cell     |

The key difference: SLD's depth-first, left-to-right search becomes the ATMS's breadth-first, dependency-directed search. This is *more complete* (no infinite loops from left-recursion) and *more efficient* (nogoods prune the search space globally).


<a id="org391a7ce"></a>

### 7.2 SLG Resolution (Tabling) on Propagators

SLG resolution extends SLD with memoization. The propagator mapping:

| SLG Concept            | Propagator Implementation                             |
|---------------------- |----------------------------------------------------- |
| Table (memo store)     | LVar with lattice answer mode                         |
| Producer               | Propagator computing new answers                      |
| Consumer               | Propagator waiting for table answers (threshold read) |
| Completion             | Table LVar frozen; no more answers                    |
| Well-founded semantics | Stratified evaluation of cyclic dependencies          |

**Lattice answer modes** (from XSB Prolog): instead of storing all individual answers, the table stores the lattice join of all answers. This subsumes Datalog evaluation and connects directly to Flix's lattice-valued relations.

```
;; SLG-style tabling with lattice answer mode
;; shortest_path(A, B, D) — D is a MinNat lattice value
table shortest_path : String -> String -> MinNat -> Prop
  :answer-mode lattice  ;; join answers via min

rule shortest_path A B 1 :- edge A B
rule shortest_path A C .{D1 + D2}
  :- edge A B, shortest_path B C D2, .{D1 = 1}
```


<a id="orgbc489c5"></a>

### 7.3 Cut and Pruning

Cut maps onto ATMS operations:

| Cut Variant                | Propagator Implementation                          |
|-------------------------- |-------------------------------------------------- |
| `!` (hard cut)             | Retract alternative hypotheses for this `amb`      |
| `once/1`                   | Threshold read + freeze on first answer            |
| `if-then-else`             | Conditional propagator (threshold on condition)    |
| Committed choice           | Guard evaluation + monotone commitment             |
| `\+` (negation-as-failure) | Stratified: evaluate goal in lower stratum, negate |

The ATMS approach is superior to Prolog's chronological backtracking because cut's *dependency-directed* counterpart (nogood recording) naturally identifies *which* choices to prune, avoiding the well-known pitfalls of "red cuts" that silently change program semantics.

**Recommendation**: Prologos should support `once` (deterministic commit) and `committed-choice` (guard-based), but NOT raw `!` (Prolog-style cut). Cut is too low-level and error-prone; the ATMS provides better alternatives.


<a id="orgd7bb753"></a>

## 8. Tabling: The Completeness Mechanism

Tabling is *essential* for a practical logic engine. Without it, left-recursive rules cause infinite loops (in SLD) or redundant computation (in naive bottom-up evaluation).


<a id="org7c5fa21"></a>

### 8.1 Design for Prologos

```prologos
;; Tabling declaration via spec metadata
spec ancestor : String -> String -> Prop
  :tabled true
  :answer-mode all  ;; or :answer-mode lattice for aggregate answers

;; Implementation is just regular rules
rule ancestor X Y :- parent X Y
rule ancestor X Y :- parent X Z, ancestor Z Y
```

Under the hood:

1.  First call to `ancestor` creates a *producer* propagator
2.  The producer evaluates rules, pushing answers into a table (LVar)
3.  Subsequent calls create *consumer* propagators that read from the table via threshold reads
4.  When the producer reaches a fixed point (no new answers), the table is frozen
5.  Consumers receive all answers


<a id="org259c3a3"></a>

### 8.2 Lattice Answer Modes

Following XSB Prolog's design, each tabled predicate can specify an answer mode:

-   **`all`**: Store all distinct answers (standard tabling). The lattice is the powerset of substitutions.
-   **`lattice(f)`**: Aggregate answers via a user-specified lattice join `f`. New answers are only "new" if they improve the current aggregate. This subsumes Datalog with lattices (Flix-style).
-   **`first`**: Store only the first answer (`once` semantics, table frozen after first answer).
