docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex
\subsubsection{8.3 Tabling as Pocket Universe}
\label{sec:org9bcefca}

Each tabled predicate's table is a "pocket universe" in the Galois
connection sense:

\begin{itemize}
\item \textbf{Abstraction}: project the calling context's substitution onto the
tabled predicate's argument positions
\item \textbf{Computation}: evaluate the tabled predicate's rules within the pocket
\item \textbf{Concretization}: lift the table's answers back into the calling context
\end{itemize}

This ensures that tabled sub-computations are modular and can be
incrementally updated when the calling context provides new information.
\subsection{9. Connecting to Existing Prologos Infrastructure}
\label{sec:org8a52c01}

\subsubsection{9.1 The Elaborator as a Propagator Network (Today)}
\label{sec:org982298b}

Prologos's elaborator \emph{already} implements propagator-like behavior:

\begin{center}
\begin{tabular}{ll}
Current Elaborator & Propagator Equivalent\\
\hline
Metavariables & Cells (lattice of types/terms)\\
Unification constraints & Propagators (join on subst lattice)\\
\texttt{resolve-trait-constraints!} & Propagators resolving dict params\\
\texttt{save/restore-meta-state!} & Speculative execution (worldviews)\\
\texttt{check-unresolved} & Detecting unsolved cells\\
Zonking & Reading final fixed-point state\\
\end{tabular}
\end{center}

The gap: these are \emph{ad hoc} rather than \emph{architected}. The metavar store
is a mutable hash table, not a lattice-structured cell. Trait resolution
uses a worklist, but doesn't record nogoods or do dependency-directed
backtracking. Speculative execution (\texttt{save/restore-meta-state!}) copies
the entire state, rather than using ATMS-style contingent values.

\textbf{Phase 1 recommendation}: Refactor the elaborator's metavar system to
use proper propagator cells with lattice merge semantics. This would
immediately improve:
\begin{itemize}
\item Error messages (dependency tracking shows \emph{why} a constraint failed)
\item Implicit argument inference (more information from bidirectional flow)
\item Speculative type checking (ATMS worldviews instead of full state copy)
\end{itemize}
\subsubsection{9.2 Session Types as Protocol Propagation}
\label{sec:orgc0c751a}

Session type checking already propagates protocol state. Making this
explicit with propagator cells would enable:
\begin{itemize}
\item Multi-party session typing (currently only binary)
\item Dependent session types (protocol depends on values)
\item Better error messages for protocol violations
\end{itemize}
\subsubsection{9.3 QTT Multiplicity Checking as Propagation}
\label{sec:org8c0a660}

Multiplicity inference (Sprint 7) already propagates multiplicity
constraints. With proper propagator cells:
\begin{itemize}
\item Multiplicity inference becomes a standard fixpoint computation
\item Multiplicity errors get dependency tracking
\item The semiring structure (\(0, 1, \omega\)) is naturally a lattice
\end{itemize}
\section{Part III: The Concrete Architecture}
\label{sec:org38611d2}

\subsection{10. Core Data Types}
\label{sec:org96ba619}

\subsubsection{10.1 Lattice Trait}
\label{sec:orgcfd006b}

\begin{verbatim}
;; The fundamental lattice abstraction
trait Lattice {A : Type}
  bot   : A
  join  : A -> A -> A
  leq   : A -> A -> Bool

;; Laws (checked via property testing):
;;   join is commutative:  join a b = join b a
;;   join is associative:  join (join a b) c = join a (join b c)
;;   join is idempotent:   join a a = a
;;   bot is identity:      join bot a = a
;;   leq is consistent:    leq a b = (join a b == b)
\end{verbatim}
\subsubsection{10.2 Propagator Cell}
\label{sec:orgb13f8b1}

\begin{verbatim}
;; A cell holds a lattice value, tracks dependents
deftype Cell (A : Type)
  :where (Lattice A)
  mk-cell : A -> Cell A

;; Core operations
spec cell-read  : {A : Type} where (Lattice A) [Cell A] -> A
spec cell-write : {A : Type} where (Lattice A) [Cell A] -> A -> Unit
  ;; cell-write c v = merge(current, v); schedule dependents if changed

spec cell-watch : {A : Type} where (Lattice A) [Cell A] -> [A -> Unit] -> Unit
  ;; Register a callback (propagator) triggered on cell value change
\end{verbatim}
\subsubsection{10.3 Supported Values (ATMS Integration)}
\label{sec:org468f5dd}

\begin{verbatim}
;; A supported value pairs information with its justification
deftype Supported (A : Type)
  mk-supported : A -> [Set Assumption] -> Supported A

;; A TMS cell holds multiple contingent values
deftype TMSCell (A : Type)
  :where (Lattice A)
  mk-tms-cell : [Set [Supported A]] -> TMSCell A
\end{verbatim}
\subsubsection{10.4 LVar (Lattice Variable)}
\label{sec:org398da1e}

\begin{verbatim}
;; LVar: monotonic lattice variable with threshold reads
deftype LVar (A : Type)
  :where (Lattice A)
  mk-lvar : A -> LVar A

spec lvar-put : {A : Type} where (Lattice A)
  [LVar A] -> A -> Unit
  ;; Inflationary: new_state = join(current, value)

spec lvar-get : {A : Type} where (Lattice A)
  [LVar A] -> [Set A] -> A
  ;; Threshold read: block until state >= some element of threshold set
  ;; Threshold elements must be pairwise incompatible

spec lvar-freeze : {A : Type} where (Lattice A)
  [LVar A] -> A
  ;; Freeze and return exact state (quasi-deterministic)
\end{verbatim}
\subsection{11. The Propagator Network Runtime}
\label{sec:orgf41ca3b}
