docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.md


<a id="org792b005"></a>

### 8.3 Tabling as Pocket Universe

Each tabled predicate's table is a "pocket universe" in the Galois connection sense:

-   **Abstraction**: project the calling context's substitution onto the tabled predicate's argument positions
-   **Computation**: evaluate the tabled predicate's rules within the pocket
-   **Concretization**: lift the table's answers back into the calling context

This ensures that tabled sub-computations are modular and can be incrementally updated when the calling context provides new information.


<a id="org0222e6e"></a>

## 9. Connecting to Existing Prologos Infrastructure


<a id="org24bbce6"></a>

### 9.1 The Elaborator as a Propagator Network (Today)

Prologos's elaborator *already* implements propagator-like behavior:

| Current Elaborator           | Propagator Equivalent               |
|---------------------------- |----------------------------------- |
| Metavariables                | Cells (lattice of types/terms)      |
| Unification constraints      | Propagators (join on subst lattice) |
| `resolve-trait-constraints!` | Propagators resolving dict params   |
| `save/restore-meta-state!`   | Speculative execution (worldviews)  |
| `check-unresolved`           | Detecting unsolved cells            |
| Zonking                      | Reading final fixed-point state     |

The gap: these are *ad hoc* rather than *architected*. The metavar store is a mutable hash table, not a lattice-structured cell. Trait resolution uses a worklist, but doesn't record nogoods or do dependency-directed backtracking. Speculative execution (`save/restore-meta-state!`) copies the entire state, rather than using ATMS-style contingent values.

**Phase 1 recommendation**: Refactor the elaborator's metavar system to use proper propagator cells with lattice merge semantics. This would immediately improve:

-   Error messages (dependency tracking shows *why* a constraint failed)
-   Implicit argument inference (more information from bidirectional flow)
-   Speculative type checking (ATMS worldviews instead of full state copy)


<a id="org56e18b6"></a>

### 9.2 Session Types as Protocol Propagation

Session type checking already propagates protocol state. Making this explicit with propagator cells would enable:

-   Multi-party session typing (currently only binary)
-   Dependent session types (protocol depends on values)
-   Better error messages for protocol violations


<a id="org95da124"></a>

### 9.3 QTT Multiplicity Checking as Propagation

Multiplicity inference (Sprint 7) already propagates multiplicity constraints. With proper propagator cells:

-   Multiplicity inference becomes a standard fixpoint computation
-   Multiplicity errors get dependency tracking
-   The semiring structure ($0, 1, \omega$) is naturally a lattice


<a id="org4ceeeba"></a>

# Part III: The Concrete Architecture


<a id="org66b9ce8"></a>

## 10. Core Data Types


<a id="org1ca4618"></a>

### 10.1 Lattice Trait

```prologos
;; The fundamental lattice abstraction
trait Lattice {A : Type}
  bot   : A
  join  : A -> A -> A
  leq   : A -> A -> Bool

;; Laws (checked via property testing):
;;   join is commutative:  join a b = join b a
;;   join is associative:  join (join a b) c = join a (join b c)
;;   join is idempotent:   join a a = a
;;   bot is identity:      join bot a = a
;;   leq is consistent:    leq a b = (join a b == b)
```


<a id="orge3428e1"></a>

### 10.2 Propagator Cell

```prologos
;; A cell holds a lattice value, tracks dependents
deftype Cell (A : Type)
  :where (Lattice A)
  mk-cell : A -> Cell A

;; Core operations
spec cell-read  : {A : Type} where (Lattice A) [Cell A] -> A
spec cell-write : {A : Type} where (Lattice A) [Cell A] -> A -> Unit
  ;; cell-write c v = merge(current, v); schedule dependents if changed

spec cell-watch : {A : Type} where (Lattice A) [Cell A] -> [A -> Unit] -> Unit
  ;; Register a callback (propagator) triggered on cell value change
```


<a id="org9fe8d6a"></a>

### 10.3 Supported Values (ATMS Integration)

```prologos
;; A supported value pairs information with its justification
deftype Supported (A : Type)
  mk-supported : A -> [Set Assumption] -> Supported A

;; A TMS cell holds multiple contingent values
deftype TMSCell (A : Type)
  :where (Lattice A)
  mk-tms-cell : [Set [Supported A]] -> TMSCell A
```


<a id="org8c1eecc"></a>

### 10.4 LVar (Lattice Variable)

```prologos
;; LVar: monotonic lattice variable with threshold reads
deftype LVar (A : Type)
  :where (Lattice A)
  mk-lvar : A -> LVar A

spec lvar-put : {A : Type} where (Lattice A)
  [LVar A] -> A -> Unit
  ;; Inflationary: new_state = join(current, value)

spec lvar-get : {A : Type} where (Lattice A)
  [LVar A] -> [Set A] -> A
  ;; Threshold read: block until state >= some element of threshold set
  ;; Threshold elements must be pairwise incompatible

spec lvar-freeze : {A : Type} where (Lattice A)
  [LVar A] -> A
  ;; Freeze and return exact state (quasi-deterministic)
```


<a id="org354e2fe"></a>

## 11. The Propagator Network Runtime
