docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex

\subsubsection{11.1 Scheduler}
\label{sec:org6aa6b4c}

\begin{verbatim}
┌──────────────────────────────┐
│       Scheduler              │
│  ┌───────────────────────┐   │
│  │  Worklist (queue)     │   │
│  │  [prop1, prop3, ...]  │   │
│  └───────────────────────┘   │
│                              │
│  Loop:                       │
│    1. Dequeue propagator     │
│    2. Execute (read inputs)  │
│    3. Write outputs (merge)  │
│    4. If cell changed:       │
│       enqueue dependents     │
│    5. If cell = top:         │
│       contradiction handler  │
│    6. Repeat until empty     │
└──────────────────────────────┘
\end{verbatim}

Properties:
\begin{itemize}
\item Jobs are idempotent (safe to re-execute)
\item Scheduling order doesn't affect the final result (lattice determinism)
\item Parallelizable: independent propagators can execute concurrently
\end{itemize}
\subsubsection{11.2 Contradiction Handler}
\label{sec:orgb09b769}

When a cell reaches \(\top\) (contradiction):

\begin{enumerate}
\item Extract the \emph{support set} (assumptions that led to contradiction)
\item Record as a \textbf{nogood} in the ATMS
\item Retract the most recently chosen hypothesis in the nogood set
\item Re-propagate with the retracted hypothesis disbelieved
\end{enumerate}

This is dependency-directed backtracking. It avoids the exponential
blowup of chronological backtracking by targeting the actual cause.
\subsubsection{11.3 The \texttt{amb} Operator}
\label{sec:org0251a8e}

\begin{verbatim}
;; amb creates a choice point with n alternatives
spec amb : {A : Type} [List A] -> A

;; Under the hood:
;; 1. Create fresh hypotheses h1, h2, ..., hn
;; 2. For each hi, create supported value (ai, {hi})
;; 3. Add mutual exclusion: exactly one hi is believed
;; 4. Return the cell containing the contingent value
\end{verbatim}
\subsubsection{11.4 Answer Collection}
\label{sec:org9206a95}

\begin{verbatim}
;; Collect all solutions from a nondeterministic computation
spec solve-all : {A : Type} [Unit -> A] -> [List A]

;; Under the hood:
;; 1. Run the computation with ATMS
;; 2. Iterate over all consistent worldviews at quiescence
;; 3. For each worldview, extract the answer
;; 4. Return list of all answers (duplicates removed)
\end{verbatim}
\subsection{12. Phased Implementation Plan}
\label{sec:org42751be}

\subsubsection{Phase 0: Lattice Trait + Basic Cells (Foundation)}
\label{sec:org485a968}

\textbf{Goal}: Establish the lattice trait and basic propagator cell infrastructure
at the Racket level.

\begin{itemize}
\item Define \texttt{Lattice} trait in Prologos
\item Provide instances: \texttt{FlatLattice} (bottom/value/top), \texttt{SetLattice}
(powerset with union), \texttt{IntervalLattice}
\item Implement \texttt{Cell} as a Racket-level struct with mutable value and
dependent list
\item Implement basic scheduler (worklist, fire-till-quiescence)
\item \textbf{\textasciitilde{}15 AST nodes} (cell-new, cell-read, cell-write, cell-watch, \ldots{})
\item \textbf{\textasciitilde{}40 tests}
\end{itemize}

\textbf{Dependencies}: None (builds on existing trait system)
\textbf{Estimated effort}: Medium
\subsubsection{Phase 1: Elaborator Propagators (Compile-Time Use)}
\label{sec:orgf29a4dd}

\textbf{Goal}: Refactor the metavar system to use propagator cells internally.

\begin{itemize}
\item Replace \texttt{current-meta-store} with propagator cells
\item Unification constraints become propagators between type cells
\item Trait resolution constraints become propagators
\item Add dependency tracking to metavar refinements
\item Improve error messages using dependency information
\item \textbf{No new surface syntax} --- this is internal refactoring
\item \textbf{\textasciitilde{}60 tests} (regression + new dependency-tracking tests)
\end{itemize}

\textbf{Dependencies}: Phase 0
\textbf{Estimated effort}: Large (touches elaborator + typing-core + unify)
\textbf{Key risk}: This is a significant refactoring of the elaborator core
\subsubsection{Phase 2: LVars + Tabling (Runtime Foundation)}
\label{sec:org7fc556d}

\textbf{Goal}: LVar data structures and tabled evaluation.

\begin{itemize}
\item Implement \texttt{LVar} with \texttt{put}, threshold \texttt{get}, and \texttt{freeze}
\item Implement \texttt{LVar-Set}, \texttt{LVar-Map} (grow-only collections)
\item Implement tabling framework: producer/consumer pattern, table LVars,
completion detection
\item Add \texttt{:tabled} spec metadata handling
\item \textbf{\textasciitilde{}20 AST nodes} (lvar-new, lvar-put, lvar-get, lvar-freeze, table-lookup, \ldots{})
\item \textbf{\textasciitilde{}50 tests}
\end{itemize}

\textbf{Dependencies}: Phase 0, Phase 2d of Core DS roadmap (transient builders)
\textbf{Estimated effort}: Large
\subsubsection{Phase 3: ATMS Layer (Nondeterministic Search)}
\label{sec:orgc29260c}

\textbf{Goal}: Assumption-based truth maintenance for hypothetical reasoning.

\begin{itemize}
\item Implement \texttt{Assumption}, \texttt{Supported}, \texttt{TMSCell} types
\item Implement nogood recording and management
\item Implement \texttt{amb} operator with hypothesis creation
\item Implement contradiction handler with dependency-directed backtracking
\item Implement \texttt{solve-all} answer collection
\item \textbf{\textasciitilde{}15 AST nodes} (amb, assume, retract, nogood, \ldots{})
\item \textbf{\textasciitilde{}60 tests}
\end{itemize}

\textbf{Dependencies}: Phase 0, Phase 2
\textbf{Estimated effort}: Large (most complex phase)
