docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.md


<a id="org1b66b50"></a>

### 11.1 Scheduler

```
┌──────────────────────────────┐
│       Scheduler              │
│  ┌───────────────────────┐   │
│  │  Worklist (queue)     │   │
│  │  [prop1, prop3, ...]  │   │
│  └───────────────────────┘   │
│                              │
│  Loop:                       │
│    1. Dequeue propagator     │
│    2. Execute (read inputs)  │
│    3. Write outputs (merge)  │
│    4. If cell changed:       │
│       enqueue dependents     │
│    5. If cell = top:         │
│       contradiction handler  │
│    6. Repeat until empty     │
└──────────────────────────────┘
```

Properties:

-   Jobs are idempotent (safe to re-execute)
-   Scheduling order doesn't affect the final result (lattice determinism)
-   Parallelizable: independent propagators can execute concurrently


<a id="orge7a7ecb"></a>

### 11.2 Contradiction Handler

When a cell reaches $\top$ (contradiction):

1.  Extract the *support set* (assumptions that led to contradiction)
2.  Record as a **nogood** in the ATMS
3.  Retract the most recently chosen hypothesis in the nogood set
4.  Re-propagate with the retracted hypothesis disbelieved

This is dependency-directed backtracking. It avoids the exponential blowup of chronological backtracking by targeting the actual cause.


<a id="org7d257c2"></a>

### 11.3 The `amb` Operator

```prologos
;; amb creates a choice point with n alternatives
spec amb : {A : Type} [List A] -> A

;; Under the hood:
;; 1. Create fresh hypotheses h1, h2, ..., hn
;; 2. For each hi, create supported value (ai, {hi})
;; 3. Add mutual exclusion: exactly one hi is believed
;; 4. Return the cell containing the contingent value
```


<a id="org546b93c"></a>

### 11.4 Answer Collection

```prologos
;; Collect all solutions from a nondeterministic computation
spec solve-all : {A : Type} [Unit -> A] -> [List A]

;; Under the hood:
;; 1. Run the computation with ATMS
;; 2. Iterate over all consistent worldviews at quiescence
;; 3. For each worldview, extract the answer
;; 4. Return list of all answers (duplicates removed)
```


<a id="org0b1a252"></a>

## 12. Phased Implementation Plan


<a id="orge2aaae0"></a>

### Phase 0: Lattice Trait + Basic Cells (Foundation)

**Goal**: Establish the lattice trait and basic propagator cell infrastructure at the Racket level.

-   Define `Lattice` trait in Prologos
-   Provide instances: `FlatLattice` (bottom/value/top), `SetLattice` (powerset with union), `IntervalLattice`
-   Implement `Cell` as a Racket-level struct with mutable value and dependent list
-   Implement basic scheduler (worklist, fire-till-quiescence)
-   **~15 AST nodes** (cell-new, cell-read, cell-write, cell-watch, &#x2026;)
-   **~40 tests**

**Dependencies**: None (builds on existing trait system) **Estimated effort**: Medium


<a id="org848259a"></a>

### Phase 1: Elaborator Propagators (Compile-Time Use)

**Goal**: Refactor the metavar system to use propagator cells internally.

-   Replace `current-meta-store` with propagator cells
-   Unification constraints become propagators between type cells
-   Trait resolution constraints become propagators
-   Add dependency tracking to metavar refinements
-   Improve error messages using dependency information
-   **No new surface syntax** &#x2014; this is internal refactoring
-   **~60 tests** (regression + new dependency-tracking tests)

**Dependencies**: Phase 0 **Estimated effort**: Large (touches elaborator + typing-core + unify) **Key risk**: This is a significant refactoring of the elaborator core


<a id="orgdf0f0d3"></a>

### Phase 2: LVars + Tabling (Runtime Foundation)

**Goal**: LVar data structures and tabled evaluation.

-   Implement `LVar` with `put`, threshold `get`, and `freeze`
-   Implement `LVar-Set`, `LVar-Map` (grow-only collections)
-   Implement tabling framework: producer/consumer pattern, table LVars, completion detection
-   Add `:tabled` spec metadata handling
-   **~20 AST nodes** (lvar-new, lvar-put, lvar-get, lvar-freeze, table-lookup, &#x2026;)
-   **~50 tests**

**Dependencies**: Phase 0, Phase 2d of Core DS roadmap (transient builders) **Estimated effort**: Large


<a id="org6fb3523"></a>

### Phase 3: ATMS Layer (Nondeterministic Search)

**Goal**: Assumption-based truth maintenance for hypothetical reasoning.

-   Implement `Assumption`, `Supported`, `TMSCell` types
-   Implement nogood recording and management
-   Implement `amb` operator with hypothesis creation
-   Implement contradiction handler with dependency-directed backtracking
-   Implement `solve-all` answer collection
-   **~15 AST nodes** (amb, assume, retract, nogood, &#x2026;)
-   **~60 tests**

**Dependencies**: Phase 0, Phase 2 **Estimated effort**: Large (most complex phase)
