docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex
\subsubsection{Phase 4: Stratified Evaluation (Negation + Aggregation)}
\label{sec:orgb5ed10a}

\textbf{Goal}: Support negation-as-failure and aggregation via stratification.

\begin{itemize}
\item Implement SCC decomposition of rule dependency graphs
\item Implement stratum-by-stratum evaluation
\item Support \texttt{not} (negation-as-failure) between strata
\item Support lattice aggregation (\texttt{count}, \texttt{min}, \texttt{max}, \texttt{sum}) between strata
\item \textbf{\textasciitilde{}10 AST nodes}
\item \textbf{\textasciitilde{}40 tests}
\end{itemize}

\textbf{Dependencies}: Phase 3
\textbf{Estimated effort}: Medium
\subsubsection{Phase 5: Surface Syntax + Integration (User-Facing Logic Programming)}
\label{sec:org2032bc7}

\textbf{Goal}: Prologos surface syntax for logic programming.

\begin{itemize}
\item \texttt{relation} declarations
\item \texttt{rule} and \texttt{query} syntax
\item Pattern matching integration with unification
\item \texttt{defn} bodies that can contain logic variables
\item Integration with the prelude and module system
\item \textbf{Grammar updates} (grammar.ebnf, grammar.org)
\item \textbf{\textasciitilde{}80 tests}
\end{itemize}

\textbf{Dependencies}: All previous phases
\textbf{Estimated effort}: Large
\subsubsection{Phase 6: Galois Connections + Domain Embeddings (Advanced)}
\label{sec:orgcbc91ce}

\textbf{Goal}: Modular constraint domains connected via Galois connections.

\begin{itemize}
\item \texttt{domain} declarations with abstraction/concretization functions
\item Cross-domain propagation
\item Abstract interpretation framework for program analysis
\item \textbf{\textasciitilde{}30 tests}
\end{itemize}

\textbf{Dependencies}: Phase 5
\textbf{Estimated effort}: Medium-Large
\section{Part IV: Critique and Open Questions}
\label{sec:org84382c5}

\subsection{13. What This Architecture Does Well}
\label{sec:org8119818}

\begin{enumerate}
\item \textbf{Unification of paradigms}: The same propagator substrate serves type
checking, constraint solving, and logic programming. This is not merely
aesthetic --- it means improvements to the propagator infrastructure
benefit all three use cases.

\item \textbf{Sound theoretical basis}: Every component has well-understood
lattice-theoretic foundations. Convergence, determinism, and soundness
are not hoped for but \emph{proven} by the mathematical framework.

\item \textbf{Incremental by construction}: Propagator networks naturally support
incremental computation. When a constraint is added or retracted, only
affected cells re-propagate. This is essential for interactive
development (IDE integration, REPL).

\item \textbf{Parallelizable by the CALM theorem}: Within a stratum, all
propagation is monotonic and therefore coordination-free. This
provides a natural path to parallel type checking and parallel
logic evaluation.

\item \textbf{Better error messages}: Dependency tracking in the ATMS means every
derived fact carries its provenance. Type errors can show exactly
\emph{which} constraints are in tension and \emph{where} they originated.
\end{enumerate}
\subsection{14. What This Architecture Doesn't Solve (Yet)}
\label{sec:org9fa9c18}

\begin{enumerate}
\item \textbf{Performance}: ATMS label management has overhead. For simple
deterministic programs, the ATMS layer is pure cost. We need a
\emph{bypass} for deterministic code paths that avoids the TMS entirely.

\item \textbf{Infinite domains}: Widening operators are needed for lattices of
infinite height (intervals, numeric constraints). Choosing the right
widening strategy is domain-specific and sometimes tricky.

\item \textbf{Efficiency of lattice answer modes}: When the lattice is large or
the join is expensive, tabling with lattice answer modes can be slow.
XSB Prolog's experience shows this requires careful implementation.

\item \textbf{Surface syntax design}: How should logic programming syntax look in
Prologos? The document proposes \texttt{relation} / \texttt{rule} / \texttt{query} but
this needs design iteration. Should it integrate with \texttt{match}? With
\texttt{where} constraints? With mixfix \texttt{.\{...\}}?

\item \textbf{Interaction with QTT}: Logic variables are inherently shared
(multiple references). How does this interact with linear types?
Preliminary answer: logic variables live at multiplicity \(\omega\)
(unrestricted), but the \emph{binding environment} can be linear.
\end{enumerate}
\subsection{15. Open Research Questions}
\label{sec:org473d69f}

\begin{enumerate}
\item \textbf{Can ATMS label management be made zero-cost for deterministic programs?}
The "speculative ATMS" idea: don't create labels until the first \texttt{amb}.
Deterministic programs never pay the ATMS overhead.

\item \textbf{How do Prologos's dependent types interact with tabling?}
Tabling requires comparing calls for "variance" (same query up to
renaming). With dependent types, this comparison involves type equality,
which may itself require propagation. Circularity risk.

\item \textbf{Can propagator-based elaboration subsume the current ad-hoc metavar
system without performance regression?} The current system is fast
because it's specialized. A general propagator system may be slower
without careful optimization.

\item \textbf{What is the right granularity for stratification?}
Per-predicate? Per-SCC? Per-module? Finer granularity allows more
parallelism but increases analysis cost.

\item \textbf{How do pocket universes compose?} Can a tabled predicate call another
tabled predicate? (Yes, but completion detection becomes more complex ---
this is the "scheduling dependency" problem in SLG resolution.)
\end{enumerate}
