docs/tracking/2026-02-24_TOWARDS_A_GENERAL_LOGIC_ENGINE_ON_PROPAGATORS.tex
\section{Summary of Recommendations}
\label{sec:org23d9433}

\begin{center}
\begin{tabular}{rll}
\# & Recommendation & Confidence\\
\hline
1 & Radul-Sussman propagator model as the substrate & High\\
2 & ATMS for hypothetical reasoning (validates Multiverse Mech.) & High\\
3 & Galois connections for domain modularity (validates Pocket U.) & High\\
4 & SLG-style tabling with lattice answer modes & High\\
5 & Stratified evaluation for negation and aggregation & High\\
6 & Start with compile-time use (elaborator), then extend to runtime & High\\
7 & No raw Prolog-style \texttt{!} cut; use \texttt{once} and committed choice & Medium\\
8 & "Speculative ATMS" for zero-cost deterministic bypass & Medium\\
9 & \texttt{Lattice} trait as foundation (user-extensible domains) & High\\
10 & Surface syntax: \texttt{relation} / \texttt{rule} / \texttt{query} keywords & Low (needs design)\\
\end{tabular}
\end{center}

\textbf{Overall assessment}: The research strongly supports the proposed
architecture. The Multiverse and Pocket Universe mechanisms are not
speculative --- they are well-established techniques (ATMS worldviews
and Galois connections respectively) with decades of theoretical
grounding and practical implementation experience. The main risk is
implementation complexity, mitigated by the phased approach starting
with the elaborator refactoring.
\section{References}
\label{sec:org7622514}

Organized by relevance to the recommended architecture:
\subsection{Foundational (Must-Read)}
\label{sec:org7278eb0}
\begin{itemize}
\item Radul \& Sussman, "The Art of the Propagator" (MIT TR, 2009)
\item Radul, \emph{Propagation Networks} (PhD thesis, MIT, 2009)
\item de Kleer, "An Assumption-Based TMS" (\emph{AI Journal}, 1986)
\item Kuper \& Newton, "LVars: Lattice-Based Data Structures for Deterministic Parallelism" (FHPC, 2013)
\item Kuper et al., "Freeze After Writing" (POPL, 2014)
\end{itemize}
\subsection{Tabling and Logic Programming}
\label{sec:orga7795f7}
\begin{itemize}
\item Swift \& Warren, "XSB: Extending Prolog with Tabled Logic Programming" (\emph{TPLP}, 2012)
\item Chen \& Warren, "Tabled Evaluation with Delaying" (\emph{JACM}, 1996)
\item Gupta et al., "Parallel Execution of Prolog Programs: A Survey" (\emph{TOPLAS}, 2001)
\end{itemize}
\subsection{Lattice-Based Languages}
\label{sec:org53c296e}
\begin{itemize}
\item Madsen et al., "From Datalog to Flix" (PLDI, 2016)
\item Arntzenius \& Krishnaswami, "Datafun: A Functional Datalog" (ICFP, 2016)
\item Arntzenius \& Krishnaswami, "Seminaive Evaluation for a Higher-Order Functional Language" (POPL, 2020)
\end{itemize}
\subsection{Theoretical Foundations}
\label{sec:org03cc6b8}
\begin{itemize}
\item Tarski, "A Lattice-Theoretical Fixpoint Theorem" (\emph{Pacific J. Math.}, 1955)
\item Cousot \& Cousot, "Abstract Interpretation: A Unified Lattice Model" (POPL, 1977)
\item Denecker et al., "Approximation Fixpoint Theory" (2012)
\item Hellerstein, "Keeping CALM" (\emph{CACM}, 2020)
\end{itemize}
\subsection{Constraint Systems}
\label{sec:org9844d6a}
\begin{itemize}
\item Fruhwirth, \emph{Constraint Handling Rules} (CUP, 2009)
\item Shapiro et al., "Conflict-Free Replicated Data Types" (INRIA, 2011)
\item Conway et al., "Logic and Lattices for Distributed Programming" (SoCC, 2012)
\end{itemize}
\subsection{Type Systems}
\label{sec:org4f7f2a1}
\begin{itemize}
\item Dunfield \& Krishnaswami, "Bidirectional Typechecking for Higher-Rank Polymorphism" (ICFP, 2014)
\item Pottier \& Remy, "The Essence of ML Type Inference" (2005)
\item Kovacs, \emph{Elaboration Zoo} (2022)
\end{itemize}
\subsection{Implementations}
\label{sec:org5936c25}
\begin{itemize}
\item Holmes (Haskell): \texttt{github.com/i-am-tom/holmes}
\item Propaganda (Clojure): \texttt{github.com/tgk/propaganda}
\item Ascent (Rust): \texttt{github.com/s-arash/ascent}
\item Guanxi (Haskell): \texttt{github.com/ekmett/guanxi}
\end{itemize}
\end{document}
